//     ____   ______ __
//    / __ \ / ____// /
//   / /_/ // /    / /
//  / ____// /___ / /___   PixInsight Class Library
// /_/     \____//_____/   PCL 02.01.07.0861
// ----------------------------------------------------------------------------
// pcl/Defs.h - Released 2017-07-09T18:07:07Z
// ----------------------------------------------------------------------------
// This file is part of the PixInsight Class Library (PCL).
// PCL is a multiplatform C++ framework for development of PixInsight modules.
//
// Copyright (c) 2003-2017 Pleiades Astrophoto S.L. All Rights Reserved.
//
// Redistribution and use in both source and binary forms, with or without
// modification, is permitted provided that the following conditions are met:
//
// 1. All redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
// 2. All redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the distribution.
//
// 3. Neither the names "PixInsight" and "Pleiades Astrophoto", nor the names
//    of their contributors, may be used to endorse or promote products derived
//    from this software without specific prior written permission. For written
//    permission, please contact info@pixinsight.com.
//
// 4. All products derived from this software, in any form whatsoever, must

#  endif
#else
#  define PCL_HOT_FUNCTION
#endif

/*
 * Aligned memory allocation functions.
 */
#ifdef _MSC_VER
#  define PCL_ALIGNED_MALLOC  _aligned_malloc
#  define PCL_ALIGNED_FREE    _aligned_free
#else
#  define PCL_ALIGNED_MALLOC  _mm_malloc
#  define PCL_ALIGNED_FREE    _mm_free
#endif

/*
 * 16-byte aligned blocks for automatic vectorization.
 */
#ifdef _MSC_VER               // Windows
#  define PCL_ALIGNED16       __declspec(align(16))
#  define PCL_ASSUME16( x )   x
#else                         // GCC and Clang
#  define PCL_ALIGNED16       __attribute__((aligned(16)))
#  define PCL_ASSUME16( x )   __builtin_assume_aligned( x, 16 )
#endif

/*
 * Current function name.
 */
#ifdef _MSC_VER
#  define PCL_FUNCTION_NAME   __FUNCTION__
#else
#  define PCL_FUNCTION_NAME   __func__
#endif

/*
 * Minimum Win32 versions supported.
 */
#ifdef __PCL_WINDOWS
#  ifndef __PCL_NO_WIN32_MINIMUM_VERSIONS
#    define WINVER            0x0601 // Windows 7
#    define _WIN32_WINNT      0x0601
#  endif
#endif

/*
 * C++11 features not supported by Visual Studio 2013.
 */
#ifdef _MSC_VER
#  if _MSC_VER < 1900
#    define constexpr
#    define noexcept
#  endif
#endif

/*
 * Size and distance types.
 */
#ifndef __PCL_NO_SIZE_AND_DISTANCE_TYPES

namespace pcl
{
/*!
 * \defgroup size_distance_types Size and Distance Types
 */

/*!
 * A type used to represent block sizes, lengths and absolute positions.
 * \ingroup size_distance_types
 */
typedef size_t                size_type;

/*!
 * A type used to represent distances and relative positions.
 * \ingroup size_distance_types
 */
typedef ptrdiff_t             distance_type;

}  // pcl

#endif   // !__PCL_NO_SIZE_AND_DISTANCE_TYPES

/*
 * Portable integer types
 */
#ifndef __PCL_NO_PORTABLE_INTEGER_TYPES

namespace pcl
{
/*!
 * \defgroup portable_integer_types Portable Integer Types
 */

/*!
 * Signed two's complement 8-bit integer type.
 * \ingroup portable_integer_types
 */
typedef signed char           int8;

/*!
 * Unsigned 8-bit integer type.
 * \ingroup portable_integer_types
 */
typedef unsigned char         uint8;

/*!
 * Signed two's complement 16-bit integer type.
 * \ingroup portable_integer_types
 */
typedef signed short          int16;

/*!
 * Unsigned 16-bit integer type.
 * \ingroup portable_integer_types
 */
typedef unsigned short        uint16;

/*!
 * Signed two's complement 32-bit integer type.
 * \ingroup portable_integer_types
 */
typedef signed int            int32;

/*!
 * Unsigned 32-bit integer type.
 * \ingroup portable_integer_types
 */
typedef unsigned int          uint32;

#ifdef _MSC_VER   // Valid for MS Visual C++
typedef signed __int64        int64;
typedef unsigned __int64      uint64;
#else             // Valid for gcc
/*!
 * Signed two's complement 64-bit integer type.
 * \ingroup portable_integer_types
 */
typedef signed long long      int64;

/*!
 * Unsigned 64-bit integer type.
 * \ingroup portable_integer_types
 */
typedef unsigned long long    uint64;
#endif // _MSC_VER

struct PCL_AssertScalarSizes
{
   static_assert( sizeof( int8 ) == 1, "Invalid sizeof( int8 )" );
   static_assert( sizeof( uint8 ) == 1, "Invalid sizeof( uint8 )" );
   static_assert( sizeof( int16 ) == 2, "Invalid sizeof( int16 )" );
   static_assert( sizeof( uint16 ) == 2, "Invalid sizeof( uint16 )" );
   static_assert( sizeof( int32 ) == 4, "Invalid sizeof( int32 )" );
   static_assert( sizeof( uint32 ) == 4, "Invalid sizeof( uint32 )" );
   static_assert( sizeof( int64 ) == 8, "Invalid sizeof( int64 )" );
   static_assert( sizeof( uint64 ) == 8, "Invalid sizeof( uint64 )" );
   static_assert( sizeof( float ) == sizeof( uint32 ), "Invalid sizeof( float )" );
   static_assert( sizeof( double ) == sizeof( uint64 ), "Invalid sizeof( double )" );
};

} // pcl

/*
 * Integer limits
 */
#ifndef __PCL_NO_INTEGER_LIMITS

/*!
 * \defgroup integer_limits Integer Limits
 */

/*!
 * \defgroup integer_conversion_factors Integer Conversion Factors
 */

#ifdef _MSC_VER   // Valid for MS Visual C++

#define int8_min            (-127i8-1)
#define int8_max              127i8
#define int8_ofs              128ui8
#define char_min              int8_min
#define char_max              int8_max

#define uint8_max             0xffui8

#define int16_min           (-32767i16-1)
#define int16_max             32767i16
#define int16_ofs             32768ui16
#define short_min             int16_min
#define short_max             int16_max

#define uint16_max            0xffffui16
#define ushort_max            uint16_max

